[
  {
    "date": "10 May 2025",
    "content": "First post of my trans sapphic communist train blog 🐾"
  },
  {
    "date": "13 May 2025",
    "content": "Barked at a train. Felt powerful."
  },
  {
    "date": "13.05.25",
    "content": "The first 2 entries are created by ChatGPT but they are too funny to delete lol"
  },
  {
    "date": "13.05.25 17:00",
    "content": "Just got message back from my healthcare provider, they are 'considering' granting me the laser hair removal..."
  },
  {
    "date": "13.05.25 20:45",
    "content": "OMG I JUST CODED SOMETHING BY MYSELF AND IT WORKED SUCK A COCK CHATGPT! I made it so the Blog and Pawprints tabs also play the bark sound!"
  },
  {
    "date": "16.05.25 03:00",
    "content": "Been thinking about the Succubus puppy girl lable... Its so weird to me how it just fits me. I feel like a fucking Isekai character 'the story how I got reincarnated as a trans puppy girl thats constantly horny'. Looking at the me from just half a year ago this is a completely diffrent person. I like how I turned out or rather how I am turning out but damn its just so diffrent. All I want to do is become a hot bitch that makes men at the beach jealous of my polycule. Taking estrogen is THE best thing that ever happened to me. <3"
  },
  {
    "date": "17.05.25 01:35",
    "content": "This story is absolutely amazing. I cant believe how much I relate to the main character. The paragraph about her chosen apperance is like copied right out of my brain.... I can not put into words what this story just did to me.",
    "link": "https://archiveofourown.org/works/62207986?view_adult=true",
    "linkText": "Puppy Paradise"
  },
  {
  "date": "17.05.25 14:55",
  "content": "Gosh being a woman is the best thing ever, I love my emotions and what estrogen does to my body... My thoughts have changed so much since I started taking estrogen, its probably just me being more honest to myself and damn what a difference that makes. I truly feel connected to myself now. I just say what I really think nowadays instead of what I think people want to hear, feels much healthier. Living for myself instead of living for the fear of missing out is also a much diffrent experience. I just want to live like this! I want to be. Everything is so much brighter and more colourful than it ever was before. I still have some hurdles to get over, I NEED bottom surgery for example. I honestly dont think a life with a penis will be a life worth living for me, I can tolerate the thing because I still need it for the surgery but damn I hate it so much. To end on a high node Im going to spend the day with my gf talking and playing games online I am unimaginably happy rn. <3"
  },
  {
  "date": "01.06.25 22:10",
  "content": "Holy shit Im in love! She is so amazing, my girlfiend was over for the weekend and HOLY SHIT! I could cuddle with her forever and we did some other fun stuff too but damn. She just needed to brush the right spot with a finger and I melted into a horny, needy poudle of absolute pleasour"
  }
]
